app/views/books/_index.html.erb

          </td>
          <td><p>コメント件数：<%= book.book_comments.count %></p></td>
---
SELECT "books".* FROM "books" INNER JOIN "favorites" ON "favorites"."book_id" = "books"."id" WHERE "favorites"."created_at" >= ? AND "favorites"."created_at" < ? GROUP BY "books"."id" ORDER BY count(*) desc  [["created_at", "2021-05-31 00:00:00"], ["created_at", "2021-06-05 01:33:39.387848"]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]