app/views/books/show.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
---
          </td>
          <td>コメント件数：<%= @book.book_comments.count %></td>