app/controllers/messages_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 3], ["room_id", 1]]
INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["room_id", 1], ["content", "aaa"], ["created_at", "2021-06-05 09:32:09.504686"], ["updated_at", "2021-06-05 09:32:09.504686"]]
---
  def create
    if Entry.where(user_id: current_user.id, room_id: params[:message][:room_id]).present?
      @message = Message.create(params.require(:message).permit(:user_id, :content, :room_id).merge(user_id: current_user.id))