app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new
    @currentUserEntry=Entry.where(user_id: current_user.id)
    @userEntry=Entry.where(user_id: @user.id)
    unless @user.id == current_user.id
      @currentUserEntry.each do |cu|
        @userEntry.each do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 3]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]